Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 300, 300, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 300, 300, 150 3900        input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 60, 60, 150)  0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 60, 60, 150)  562650      max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 12, 12, 150)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 12, 12, 150)  202650      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 4, 4, 150)    0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 4, 4, 150)    90150       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 2)]          0                                            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 2, 2, 150)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2)            0           input_2[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 600)          0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 602)          0           flatten_1[0][0]                  
                                                                 flatten[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 600)          361800      concatenate[0][0]                
__________________________________________________________________________________________________
reshape (Reshape)               (None, 2, 2, 150)    0           dense[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 2, 2, 150)    90150       reshape[0][0]                    
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 4, 4, 150)    0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 4, 150)    202650      up_sampling2d[0][0]              
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 12, 12, 150)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 12, 12, 150)  562650      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 60, 60, 150)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 60, 60, 150)  562650      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 300, 300, 150 0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
tf.math.greater (TFOpLambda)    (None, 300, 300, 1)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 300, 300, 2)  302         up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
tf.cast (TFOpLambda)            (None, 300, 300, 1)  0           tf.math.greater[0][0]            
__________________________________________________________________________________________________
masking_layer (MaskingLayer)    (None, 300, 300, 2)  0           conv2d_8[0][0]                   
                                                                 tf.cast[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 300, 300, 1)  0           masking_layer[0][0]              
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 300, 300, 1)  0           masking_layer[0][0]              
==================================================================================================
Total params: 2,639,552
Trainable params: 2,639,552
Non-trainable params: 0
__________________________________________________________________________________________________